
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十一章　后序 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="chapter-10-archives.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter-01-overview.html">
            
                <a href="chapter-01-overview.html">
            
                    
                    第一章　　概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter-02-introduction.html">
            
                <a href="chapter-02-introduction.html">
            
                    
                    第二章　　Makefile 介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter-03-rules.html">
            
                <a href="chapter-03-rules.html">
            
                    
                    第三章　　书写规则
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter-04-recipes.html">
            
                <a href="chapter-04-recipes.html">
            
                    
                    第四章　　书写命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter-05-variables.html">
            
                <a href="chapter-05-variables.html">
            
                    
                    第五章　　使用变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter-06-conditionals.html">
            
                <a href="chapter-06-conditionals.html">
            
                    
                    第六章　　使用条件判断
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter-07-functions.html">
            
                <a href="chapter-07-functions.html">
            
                    
                    第七章　　使用函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter-08-invoke.html">
            
                <a href="chapter-08-invoke.html">
            
                    
                    第八章　　make的运行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter-09-implicit_rules.html">
            
                <a href="chapter-09-implicit_rules.html">
            
                    
                    第九章　　隐含规则
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter-10-archives.html">
            
                <a href="chapter-10-archives.html">
            
                    
                    第十章　　使用make更新函数库文件
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="chapter-11-postscript.html">
            
                <a href="chapter-11-postscript.html">
            
                    
                    第十一章　后序
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十一章　后序</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#11-&#x540E;&#x5E8F;"><b></b>11. &#x540E;&#x5E8F;</a></li></ul></div><a href="#11-&#x540E;&#x5E8F;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="11-&#x540E;&#x5E8F;"><a name="11-&#x540E;&#x5E8F;" class="anchor-navigation-ex-anchor" href="#11-&#x540E;&#x5E8F;"><i class="fa fa-link" aria-hidden="true"></i></a>11. &#x540E;&#x5E8F;</h1>
<p>&#x7EC8;&#x4E8E;&#x5230;&#x5199;&#x7ED3;&#x675F;&#x8BED;&#x7684;&#x65F6;&#x5019;&#x4E86;&#xFF0C;&#x4EE5;&#x4E0A;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;GNU make&#x7684;Makefile&#x7684;&#x6240;&#x6709;&#x7EC6;&#x8282;&#x4E86;&#x3002;&#x5176;&#x5B83;&#x7684;&#x5382;&#x5546;&#x7684;make&#x57FA;&#x672C;&#x4E0A;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x65E0;&#x8BBA;&#x4EC0;&#x4E48;&#x6837;&#x7684;make&#xFF0C;&#x90FD;&#x662F;&#x4EE5;&#x6587;&#x4EF6;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#xFF0C;&#x5176;&#x57FA;&#x672C;&#x662F;&#x90FD;&#x662F;&#x9075;&#x5FAA;&#x4E00;&#x4E2A;&#x6807;&#x51C6;&#x7684;&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x6863;&#x4E2D;80%&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x90FD;&#x9002;&#x7528;&#x4E8E;&#x4EFB;&#x4F55;&#x7684;make&#xFF0C;&#x6211;&#x731C;&#x6D4B;&quot;&#x51FD;&#x6570;&quot;&#x90A3;&#x4E00;&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5176;&#x5B83;make&#x6240;&#x652F;&#x6301;&#x7684;&#xFF0C;&#x800C;&#x9690;&#x542B;&#x89C4;&#x5219;&#x65B9;&#x9762;&#xFF0C;&#x6211;&#x60F3;&#x4E0D;&#x540C;&#x7684;make&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x7CBE;&#x529B;&#x6765;&#x67E5;&#x770B;GNU&#x7684;make&#x548C;VC&#x7684;nmake&#x3001;BCB&#x7684;make&#xFF0C;&#x6216;&#x662F;&#x522B;&#x7684;UNIX&#x4E0B;&#x7684;make&#x6709;&#x4E9B;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x4E00;&#x662F;&#x65F6;&#x95F4;&#x7CBE;&#x529B;&#x4E0D;&#x591F;&#xFF0C;&#x4E8C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;&#x5728;Unix&#x4E0B;&#x4F7F;&#x7528;make&#xFF0C;&#x4EE5;&#x524D;&#x5728;SCO Unix&#x548C;IBM&#x7684;AIX&#xFF0C;&#x73B0;&#x5728;&#x5728;Linux&#x3001;Solaris&#x3001;HP-UX&#x3001;AIX&#x548C;Alpha&#x4E0B;&#x4F7F;&#x7528;&#xFF0C;Linux&#x548C;Solaris&#x4E0B;&#x66F4;&#x591A;&#x4E00;&#x70B9;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x7684;&#x662F;&#xFF0C;&#x5728;Unix&#x4E0B;&#x7684;make&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x54EA;&#x79CD;&#x5E73;&#x53F0;&#xFF0C;&#x51E0;&#x4E4E;&#x90FD;&#x4F7F;&#x7528;&#x4E86;Richard Stallman&#x5F00;&#x53D1;&#x7684;make&#x548C;cc/gcc&#x7684;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;GNU&#x7684;make&#xFF08;&#x516C;&#x53F8;&#x91CC;&#x6240;&#x6709;&#x7684;UNIX&#x673A;&#x5668;&#x4E0A;&#x90FD;&#x88AB;&#x88C5;&#x4E0A;&#x4E86;GNU&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4F7F;&#x7528;GNU&#x7684;&#x7A0B;&#x5E8F;&#x4E5F;&#x5C31;&#x591A;&#x4E86;&#x4E00;&#x4E9B;&#xFF09;&#x3002;GNU&#x7684;&#x4E1C;&#x897F;&#x8FD8;&#x662F;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4F7F;&#x7528;&#x5F97;&#x6DF1;&#x4E86;&#x4EE5;&#x540E;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x89C9;&#x5F97;GNU&#x7684;&#x8F6F;&#x4EF6;&#x7684;&#x5F3A;&#x5927;&#xFF0C;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x89C9;&#x5F97;GNU&#x7684;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF08;&#x4E3B;&#x8981;&#x662F;Unix&#xFF0C;&#x751A;&#x81F3;Windows&#xFF09;&quot;&#x6740;&#x4F24;&#x529B;&quot;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E0A;&#x8FF0;&#x6240;&#x6709;&#x7684;make&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F46;&#x53EF;&#x4EE5;&#x5229;&#x7528;make&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x6765;&#x7F16;&#x8BD1;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5229;&#x7528;make&#x6765;&#x5B8C;&#x6210;&#x5176;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x89C4;&#x5219;&#x4E2D;&#x7684;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;Shell&#x4E4B;&#x4E0B;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5728;Unix&#x4E0B;&#xFF0C;&#x4F60;&#x4E0D;&#x4E00;&#x5B9A;&#x53EA;&#x662F;&#x4F7F;&#x7528;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;Makefile&#x4E2D;&#x4E66;&#x5199;&#x5176;&#x5B83;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x5982;&#xFF1A;tar&#x3001;awk&#x3001;mail&#x3001;sed&#x3001;cvs&#x3001;compress&#x3001;ls&#x3001;rm&#x3001;yacc&#x3001;rpm&#x3001;ftp&#x7B49;&#x7B49;&#xFF0C;&#x7B49;&#x7B49;&#xFF0C;&#x6765;&#x5B8C;&#x6210;&#x8BF8;&#x5982;&quot;&#x7A0B;&#x5E8F;&#x6253;&#x5305;&quot;&#x3001;&quot;&#x7A0B;&#x5E8F;&#x5907;&#x4EFD;&quot;&#x3001;&quot;&#x5236;&#x4F5C;&#x7A0B;&#x5E8F;&#x5B89;&#x88C5;&#x5305;&quot;&#x3001;&quot;&#x63D0;&#x4EA4;&#x4EE3;&#x7801;&quot;&#x3001;&quot;&#x4F7F;&#x7528;&#x7A0B;&#x5E8F;&#x6A21;&#x677F;&quot;&#x3001;&quot;&#x5408;&#x5E76;&#x6587;&#x4EF6;&quot;&#x7B49;&#x7B49;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6587;&#x4EF6;&#x64CD;&#x4F5C;&#xFF0C;&#x6587;&#x4EF6;&#x7BA1;&#x7406;&#xFF0C;&#x7F16;&#x7A0B;&#x5F00;&#x53D1;&#x8BBE;&#x8BA1;&#xFF0C;&#x6216;&#x662F;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x5F02;&#x60F3;&#x5929;&#x5F00;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4EE5;&#x524D;&#x5728;&#x4E66;&#x5199;&#x94F6;&#x884C;&#x4EA4;&#x6613;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x94F6;&#x884C;&#x7684;&#x4EA4;&#x6613;&#x7A0B;&#x5E8F;&#x57FA;&#x672C;&#x4E00;&#x6837;&#xFF0C;&#x5C31;&#x89C1;&#x5230;&#x6709;&#x4EBA;&#x4E66;&#x5199;&#x4E86;&#x4E00;&#x4E9B;&#x4EA4;&#x6613;&#x7684;&#x901A;&#x7528;&#x7A0B;&#x5E8F;&#x6A21;&#x677F;&#xFF0C;&#x5728;&#x8BE5;&#x6A21;&#x677F;&#x4E2D;&#x628A;&#x4E00;&#x4E9B;&#x7F51;&#x7EDC;&#x901A;&#x8BAF;&#x3001;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x7684;&#x3001;&#x4E1A;&#x52A1;&#x64CD;&#x4F5C;&#x5171;&#x6027;&#x7684;&#x4E1C;&#x897F;&#x5199;&#x5728;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x4E2D;&#x7528;&#x4E9B;&#x8BF8;&#x5982;&quot;@@\@N&#x3001;###N&quot;&#x5947;&#x602A;&#x5B57;&#x4E32;&#x6807;&#x6CE8;&#x4E00;&#x4E9B;&#x4F4D;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x4E66;&#x5199;&#x4EA4;&#x6613;&#x65F6;&#xFF0C;&#x53EA;&#x9700;&#x6309;&#x7167;&#x4E00;&#x79CD;&#x7279;&#x5B9A;&#x7684;&#x89C4;&#x5219;&#x4E66;&#x5199;&#x7279;&#x5B9A;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x6700;&#x540E;&#x5728;make&#x65F6;&#xFF0C;&#x4F7F;&#x7528;awk&#x548C;sed&#xFF0C;&#x628A;&#x6A21;&#x677F;&#x4E2D;&#x7684;&quot;@@\@N&#x3001;###N&quot;&#x7B49;&#x5B57;&#x4E32;&#x66FF;&#x4EE3;&#x6210;&#x7279;&#x5B9A;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5F62;&#x6210;C&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7F16;&#x8BD1;&#x3002;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x5F88;&#x50CF;&#x6570;&#x636E;&#x5E93;&#x7684;&quot;&#x6269;&#x5C55;C&quot;&#x8BED;&#x8A00;&#xFF08;&#x5373;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x7528;&quot;EXEC SQL&quot;&#x7684;&#x6837;&#x5B50;&#x6267;&#x884C;SQL&#x8BED;&#x53E5;&#xFF0C;&#x5728;&#x7528;cc/gcc&#x7F16;&#x8BD1;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;&quot;&#x6269;&#x5C55;C&quot;&#x7684;&#x7FFB;&#x8BD1;&#x7A0B;&#x5E8F;&#xFF0C;&#x5982;cpre&#xFF0C;&#x628A;&#x5176;&#x7FFB;&#x8BD1;&#x6210;&#x6807;&#x51C6;C&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4F7F;&#x7528;make&#x65F6;&#x6709;&#x4E00;&#x4E9B;&#x66F4;&#x4E3A;&#x7EDD;&#x5999;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BF7;&#x8BB0;&#x5F97;&#x544A;&#x8BC9;&#x6211;&#x554A;&#x3002;</p>
<p>&#x56DE;&#x5934;&#x770B;&#x770B;&#x6574;&#x7BC7;&#x6587;&#x6863;&#xFF0C;&#x4E0D;&#x89C9;&#x8BB0;&#x8D77;&#x51E0;&#x5E74;&#x524D;&#x521A;&#x521A;&#x5F00;&#x59CB;&#x5728;Unix&#x4E0B;&#x505A;&#x5F00;&#x53D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4EBA;&#x95EE;&#x6211;&#x4F1A;&#x4E0D;&#x4F1A;&#x5199;Makefile&#x65F6;&#xFF0C;&#x6211;&#x4E24;&#x773C;&#x53D1;&#x76F4;&#xFF0C;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x5728;&#x8BF4;&#x4EC0;&#x4E48;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x770B;&#x5230;&#x522B;&#x4EBA;&#x5728;vi&#x4E2D;&#x5199;&#x5B8C;&#x7A0B;&#x5E8F;&#x540E;&#x8F93;&#x5165;&quot;!make&quot;&#x65F6;&#xFF0C;&#x8FD8;&#x4EE5;&#x4E3A;&#x662F;vi&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x540E;&#x6765;&#x624D;&#x77E5;&#x9053;&#x6709;&#x4E00;&#x4E2A;Makefile&#x5728;&#x4F5C;&#x602A;&#xFF0C;&#x4E8E;&#x662F;&#x4E0A;&#x7F51;&#x67E5;&#x554A;&#x67E5;&#xFF0C;&#x90A3;&#x65F6;&#x53C8;&#x4E0D;&#x613F;&#x610F;&#x770B;&#x82F1;&#x6587;&#xFF0C;&#x53D1;&#x73B0;&#x5C31;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x4E2D;&#x6587;&#x7684;&#x6587;&#x6863;&#x4ECB;&#x7ECD;Makefile&#xFF0C;&#x53EA;&#x5F97;&#x770B;&#x522B;&#x4EBA;&#x5199;&#x7684;Makefile&#xFF0C;&#x81EA;&#x5DF1;&#x778E;&#x78B0;&#x778E;&#x641E;&#x624D;&#x79EF;&#x7D2F;&#x4E86;&#x4E00;&#x70B9;&#x77E5;&#x8BC6;&#xFF0C;&#x4F46;&#x5728;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x5B8C;&#x5168;&#x662F;&#x77E5;&#x5176;&#x7136;&#x4E0D;&#x77E5;&#x6240;&#x4EE5;&#x7136;&#x3002;&#x540E;&#x6765;&#x5F00;&#x59CB;&#x4ECE;&#x4E8B;UNIX&#x4E0B;&#x4EA7;&#x54C1;&#x8F6F;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x770B;&#x5230;&#x4E00;&#x4E2A;400&#x4EBA;&#xFF0C;&#x8FD1;200&#x4E07;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x5927;&#x5DE5;&#x7A0B;&#xFF0C;&#x53D1;&#x73B0;&#x8981;&#x7F16;&#x8BD1;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5E9E;&#x7136;&#x5927;&#x7269;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;Makefile&#xFF0C;&#x90A3;&#x4F1A;&#x662F;&#x591A;&#x4E48;&#x6050;&#x6016;&#x7684;&#x4E00;&#x6837;&#x4E8B;&#x554A;&#x3002;&#x4E8E;&#x662F;&#x6A2A;&#x4E0B;&#x5FC3;&#x6765;&#xFF0C;&#x72E0;&#x547D;&#x5730;&#x8BFB;&#x4E86;&#x4E00;&#x5806;&#x82F1;&#x6587;&#x6587;&#x6863;&#xFF0C;&#x624D;&#x89C9;&#x5F97;&#x5BF9;&#x5176;&#x638C;&#x63E1;&#x4E86;&#x3002;&#x4F46;&#x53D1;&#x73B0;&#x76EE;&#x524D;&#x7F51;&#x4E0A;&#x5BF9;Makefile&#x4ECB;&#x7ECD;&#x7684;&#x6587;&#x7AE0;&#x8FD8;&#x662F;&#x5C11;&#x5F97;&#x90A3;&#x4E48;&#x7684;&#x53EF;&#x601C;&#xFF0C;&#x6240;&#x4EE5;&#x60F3;&#x5199;&#x8FD9;&#x6837;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x5171;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x5BF9;&#x5404;&#x4F4D;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x7EC8;&#x4E8E;&#x5199;&#x5B8C;&#x4E86;&#xFF0C;&#x770B;&#x4E86;&#x770B;&#x6587;&#x4EF6;&#x7684;&#x521B;&#x5EFA;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x7BC7;&#x6280;&#x672F;&#x6587;&#x6863;&#x4E5F;&#x5199;&#x4E86;&#x4E24;&#x4E2A;&#x591A;&#x6708;&#x4E86;&#x3002;&#x53D1;&#x73B0;&#xFF0C;&#x81EA;&#x5DF1;&#x77E5;&#x9053;&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#xFF0C;&#x8981;&#x5199;&#x4E0B;&#x6765;&#xFF0C;&#x8DDF;&#x522B;&#x4EBA;&#x8BB2;&#x8FF0;&#x53C8;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x56DE;&#x4E8B;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x73B0;&#x5728;&#x8D8A;&#x6765;&#x8D8A;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x94BB;&#x7814;&#x6280;&#x672F;&#x7EC6;&#x8282;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5199;&#x4F5C;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x5728;&#x9610;&#x8FF0;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x95EE;&#x9898;&#x65F6;&#x5F88;&#x96BE;&#x505A;&#x5230;&#x4E25;&#x8C28;&#x548C;&#x7CBE;&#x70BC;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x5148;&#x8BB2;&#x4EC0;&#x4E48;&#x540E;&#x8BB2;&#x4EC0;&#x4E48;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD8;&#x662F;&#x53C2;&#x8003;&#x4E86;&#x4E00;&#x4E9B;&#x56FD;&#x5916;&#x7AD9;&#x70B9;&#x4E0A;&#x7684;&#x8D44;&#x6599;&#x548C;&#x63D0;&#x7EB2;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x4E66;&#x7C4D;&#x7684;&#x8BED;&#x8A00;&#x98CE;&#x683C;&#xFF0C;&#x624D;&#x5F97;&#x4EE5;&#x5B8C;&#x6210;&#x3002;&#x6574;&#x7BC7;&#x6587;&#x6863;&#x7684;&#x63D0;&#x7EB2;&#x662F;&#x57FA;&#x4E8E;GNU&#x7684;Makefile&#x6280;&#x672F;&#x624B;&#x518C;&#x7684;&#x63D0;&#x7EB2;&#x6765;&#x4E66;&#x5199;&#x7684;&#xFF0C;&#x5E76;&#x7ED3;&#x5408;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#xFF0C;&#x4EE5;&#x53CA;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x5386;&#x7A0B;&#x3002;&#x56E0;&#x4E3A;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x5199;&#x8FC7;&#x8FD9;&#x4E48;&#x957F;&#xFF0C;&#x8FD9;&#x4E48;&#x7EC6;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x5B58;&#x5728;&#x8868;&#x8FBE;&#x95EE;&#x9898;&#xFF0C;&#x8BED;&#x8A00;&#x6B67;&#x4E49;&#x6216;&#x662F;&#x9519;&#x8BEF;&#x3002;&#x56E0;&#x4E9B;&#xFF0C;&#x6211;&#x8FEB;&#x5207;&#x5730;&#x7B49;&#x5F85;&#x5404;&#x4F4D;&#x7ED9;&#x6211;&#x6307;&#x6B63;&#x548C;&#x5EFA;&#x8BAE;&#xFF0C;&#x4EE5;&#x53CA;&#x4EFB;&#x4F55;&#x7684;&#x53CD;&#x9988;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x8FD8;&#x662F;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x540E;&#x5E8F;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x3002;&#x6211;&#x76EE;&#x524D;&#x4ECE;&#x4E8B;&#x4E8E;&#x6240;&#x6709;Unix&#x5E73;&#x53F0;&#x4E0B;&#x7684;&#x8F6F;&#x4EF6;&#x7814;&#x53D1;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x505A;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;/&#x7F51;&#x683C;&#x8BA1;&#x7B97;&#x65B9;&#x9762;&#x7684;&#x7CFB;&#x7EDF;&#x4EA7;&#x54C1;&#x8F6F;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x5BF9;&#x4E8E;&#x4E0B;&#x4E00;&#x4EE3;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x9769;&#x547D;------&#x7F51;&#x683C;&#x8BA1;&#x7B97;&#x975E;&#x5E38;&#x5730;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x5BF9;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x3001;P2P&#x3001;Web Service&#x3001;J2EE&#x6280;&#x672F;&#x65B9;&#x5411;&#x4E5F;&#x5F88;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x3001;&#x56E2;&#x961F;&#x7BA1;&#x7406;&#x3001;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4E5F;&#x5C0F;&#x6709;&#x5FC3;&#x5F97;&#xFF0C;&#x5E0C;&#x671B;&#x540C;&#x6837;&#x548C;&#x6211;&#x6218;&#x6597;&#x5728;&quot;&#x6280;&#x672F;&#x548C;&#x7BA1;&#x7406;&#x5E76;&#x91CD;&quot;&#x7684;&#x9635;&#x7EBF;&#x4E0A;&#x7684;&#x5E74;&#x8F7B;&#x4E00;&#x4EE3;&#xFF0C;&#x80FD;&#x591F;&#x548C;&#x6211;&#x591A;&#x591A;&#x5730;&#x4EA4;&#x6D41;&#x3002;&#x6211;&#x7684;MSN&#x662F;&#xFF1A;<a href="mailto:haoel@hotmail.com" target="_blank">haoel@hotmail.com</a>&#xFF08;&#x5E38;&#x7528;&#xFF09;&#xFF0C;QQ&#x662F;&#xFF1A;753640&#xFF08;&#x4E0D;&#x5E38;&#x7528;&#xFF09;&#x3002;&#xFF08;&#x6CE8;&#xFF1A;&#x8BF7;&#x52FF;&#x7ED9;&#x6211;MSN&#x7684;&#x90AE;&#x7BB1;&#x53D1;&#x4FE1;&#xFF0C;&#x7531;&#x4E8E;hotmail&#x7684;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x5BFC;&#x81F4;&#x6211;&#x62D2;&#x6536;&#x8FD9;&#x4E2A;&#x90AE;&#x7BB1;&#x7684;&#x6240;&#x6709;&#x6765;&#x4FE1;&#xFF09;</p>
<p>&#x6211;&#x6B22;&#x8FCE;&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x8BA8;&#x8BBA;&#x6280;&#x672F;&#x8FD8;&#x662F;&#x7BA1;&#x7406;&#xFF0C;&#x6216;&#x662F;&#x5176;&#x5B83;&#x6D77;&#x9614;&#x5929;&#x7A7A;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x9664;&#x4E86;&#x653F;&#x6CBB;&#x548C;&#x5A31;&#x4E50;&#x65B0;&#x95FB;&#x6211;&#x4E0D;&#x5173;&#x5FC3;&#xFF0C;&#x5176;&#x5B83;&#x53EA;&#x8981;&#x79EF;&#x6781;&#x5411;&#x4E0A;&#x7684;&#x4E1C;&#x897F;&#x6211;&#x90FD;&#x6B22;&#x8FCE;&#xFF01;</p>
<p>&#x6700;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x8FD8;&#x60F3;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;make&#x7A0B;&#x5E8F;&#x7684;&#x8BBE;&#x8BA1;&#x5F00;&#x53D1;&#x8005;&#x3002;</p>
<p>&#x9996;&#x5F53;&#x5176;&#x51B2;&#x7684;&#x662F;&#xFF1A;Richard Stallman</p>
<p>&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x9886;&#x8896;&#x548C;&#x5148;&#x9A71;&#xFF0C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x9886;&#x8FC7;&#x4E00;&#x5929;&#x5DE5;&#x8D44;&#xFF0C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x8FC7;Windows&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x5BF9;&#x4E8E;&#x4ED6;&#x7684;&#x4E8B;&#x8FF9;&#x548C;&#x4ED6;&#x7684;&#x8F6F;&#x4EF6;&#x4EE5;&#x53CA;&#x4ED6;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x6211;&#x65E0;&#x9700;&#x8BF4;&#x8FC7;&#x591A;&#x7684;&#x8BDD;&#xFF0C;&#x76F8;&#x4FE1;&#x5927;&#x5BB6;&#x5BF9;&#x8FD9;&#x4E2A;&#x4EBA;&#x5E76;&#x4E0D;&#x6BD4;&#x6211;&#x964C;&#x751F;&#xFF0C;&#x8FD9;&#x662F;&#x4ED6;&#x7684;&#x4E3B;&#x9875;&#xFF1A;<a href="http://www.stallman.org/" target="_blank">http://www.stallman.org/</a> &#x3002;&#x8FD9;&#x91CC;&#x53EA;&#x8D34;&#x4E0A;&#x4E00;&#x5F20;&#x4ED6;&#x7684;&#x8FD1;&#x7167;&#xFF1A;</p>
<p><img src="https://media.libreplanet.org/mgoblin_media/media_entries/2207/rms-closeup.medium.jpg" alt="Richard Stallman, at LibrePlanet 2019"></p>
<p>&#x7B2C;&#x4E8C;&#x4F4D;&#x662F;&#xFF1A;Roland McGrath</p>
<p>&#x4E2A;&#x4EBA;&#x4E3B;&#x9875;&#x662F;&#xFF1A;<a href="http://www.frob.com/\~roland/" target="_blank">http://www.frob.com/\~roland/</a> &#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x4ED6;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x8FF9;&#xFF1A;</p>
<ol>
<li>&#x5408;&#x4F5C;&#x7F16;&#x5199;&#x4E86;&#x5E76;&#x7EF4;&#x62A4;GNU make&#x3002;</li>
<li>&#x548C;Thomas Bushnell&#x4E00;&#x540C;&#x7F16;&#x5199;&#x4E86;GNU Hurd&#x3002;</li>
<li>&#x7F16;&#x5199;&#x5E76;&#x7EF4;&#x62A4;&#x7740;GNU C library&#x3002;</li>
<li>&#x5408;&#x4F5C;&#x7F16;&#x5199;&#x5E76;&#x7EF4;&#x62A4;&#x7740;&#x90E8;&#x5206;&#x7684;GNU Emacs&#x3002;</li>
</ol>
<p>&#x5728;&#x6B64;&#xFF0C;&#x5411;&#x8FD9;&#x4E24;&#x4F4D;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x6597;&#x58EB;&#x81F4;&#x4EE5;&#x6700;&#x771F;&#x5207;&#x7684;&#x656C;&#x610F;&#x3002;</p>
<p>&#xFF08;&#x5168;&#x6587;&#x5B8C;&#xFF09;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter-10-archives.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第十章　　使用make更新函数库文件">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十一章　后序","level":"1.12","depth":1,"previous":{"title":"第十章　　使用make更新函数库文件","level":"1.11","depth":1,"path":"articles/chapter-10-archives.md","ref":"./articles/chapter-10-archives.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","-highlight","prism","-sharing","github","anchor-navigation-ex","edit-link","theme-comscore","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/lewis1573/write-makefile-with-me"},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"fontSettings":{"theme":"night","family":"sans"},"anchor-navigation-ex":{"associatedWithSummary":false,"float":{"floatIcon":"fa fa-navicon","level1Icon":"fa fa-hand-o-right","level2Icon":"fa fa-hand-o-right","level3Icon":"fa fa-hand-o-right","showLevelIcon":false},"mode":"float","multipleH1":false,"pageTop":{"level1Icon":"fa fa-hand-o-right","level2Icon":"fa fa-hand-o-right","level3Icon":"fa fa-hand-o-right","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":false},"theme-comscore":{},"ga":{"configuration":"auto","token":""},"edit-link":{"label":"Edit This Page","base":"https://github.com/lewis1573/write-makefile-with-me/edit/master/book_sources/"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"zh-hans","gitbook":"*"},"file":{"path":"articles/chapter-11-postscript.md","mtime":"2024-05-29T11:48:45.527Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-05-29T11:49:16.297Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

